tap "steipete/tap"
tap "stripe/stripe-cli"
brew "git"
brew "asdf"
brew "ast-grep"
brew "aws-cdk"
brew "libyaml"
brew "aws-sam-cli"
brew "awscli"
brew "curl"
brew "devcontainer"
brew "fd"
brew "firebase-cli"
brew "gawk"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "gnupg"
brew "golangci-lint"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "mas"
brew "mermaid-cli"
brew "neovim"
brew "peco"
brew "postgresql@16", link: true
brew "python@3.12"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "steipete/tap/gogcli"
brew "stripe/stripe-cli/stripe"
cask "alfred"
cask "alt-tab"
cask "ankerwork"
cask "appcleaner"
cask "chatgpt"
cask "claude"
cask "copilot-cli"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "fujitsu-scansnap-home"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "keyclu"
cask "logi-options+"
cask "ngrok"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "paintbrush"
cask "pgadmin4"
cask "session-manager-plugin"
cask "sketch"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "wezterm@nightly"
cask "zoom"
mas "BetterSnapTool", id: 417375580
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
vscode "aki77.rails-db-schema"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "corschenzi.mermaid-graphical-editor"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hediet.vscode-drawio"
vscode "kaiwood.endwise"
vscode "koichisasada.vscode-rdbg"
vscode "mhutchie.git-graph"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "thadeu.vscode-run-rspec-file"
